glcloud/keil_v5/ARM/PACK/.Web/Keil.STM32WBxx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32WBxx_DFP</name>
  <description>STMicroelectronics STM32WB Series Device Support</description>
  <url>http://www.keil.com/pack</url>

  <releases>
    <release version="1.0.0" date="2019-03-01">
      Initial version of STM32WB Device Family Pack.
      This Device Family Pack requires the installation of:
      - STM32CubeMX V5.1.0
      - STM32Cube WB Firmware Package V1.0.0
    </release>
  </releases>

<!-- keywords for indexing -->
  <keywords>
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32WB</keyword>
    <keyword>STM32WBxx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32WB Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Configurable" Dclock="10000000"/>
      <book name="Documentation/DUI0553.pdf" title="Cortex-M4 Generic User Guide"/>
      <description>
The STM32WB55xx multiprotocol wireless and ultra-low-power devices embed a powerful and ultra-low-power radio compliant with the Bluetooth® Low Energy SIG specification v5.0 and with IEEE 802.15.4-2011.
They contain a dedicated Arm® Cortex® -M0+ for performing all the real-time low layer operation. The STM32WB55xx devices are designed to be extremely low-power and are based on the high-performance Arm® Cortex®-M4 32-bit RISC core operating at a frequency of up to 64 MHz.
The Cortex®-M4 core features a Floating point unit (FPU) single precision that supports all Arm® single-precision data-processing instructions and data types.
It also implements a full set of DSP instructions and a memory protection unit (MPU) that enhances application security.
    </description>

      <!-- ************************  Subfamily 'STM32WB55'  **************************** -->
      <subFamily DsubFamily="STM32WB55">
        <debug svd="CMSIS/SVD/STM32WBxx_CM4.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32WBxx/Include/stm32wbxx.h" define="STM32WB55xx"/>

        <book name="Documentation/DM00344191.pdf" title="STM32WB55xx Data Sheet"/>

        <!-- *************************  Device 'STM32WB55CC'  ***************************** -->
        <device Dname="STM32WB55CCUx">
          <memory id="IROM1"                           start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                           start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32WB_M4.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32WB55CE'  ***************************** -->
        <device Dname="STM32WB55CEUx">

          <memory id="IROM1"                           start="0x08000000" size="0x00080000" startup="1" default="1" />
          <memory id="IRAM1"                           start="0x20000000" size="0x00040000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32WB_M4.FLM" start="0x08000000" size="0x00080000"             default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32WB55CG'  ***************************** -->
        <device Dname="STM32WB55CGUx">
          <memory id="IROM1"                           start="0x08000000" size="0x00100000" startup="1" default="1" />
          <memory id="IRAM1"                           start="0x20000000" size="0x00040000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32WB_M4.FLM" start="0x08000000" size="0x00100000"             default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32WB55RC'  ***************************** -->
        <device Dname="STM32WB55RCVx">
          <memory id="IROM1"                           start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                           start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32WB_M4.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <feature type="QFP" n="68"/>
        </device>

        <!-- *************************  Device 'STM32WB55RE'  ***************************** -->
        <device Dname="STM32WB55REVx">
          <memory id="IROM1"                           start="0x08000000" size="0x00080000" startup="1" default="1" />
          <memory id="IRAM1"                           start="0x20000000" size="0x00040000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32WB_M4.FLM" start="0x08000000" size="0x00080000"             default="1" />

          <feature type="QFP" n="68"/>
        </device>

        <!-- *************************  Device 'STM32WB55RG'  ***************************** -->
        <device Dname="STM32WB55RGVx">
          <memory id="IROM1"                           start="0x08000000" size="0x001000000" startup="1" default="1" />
          <memory id="IRAM1"                           start="0x20000000" size="0x000040000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32WB_M4.FLM" start="0x08000000" size="0x001000000"             default="1" />

          <feature type="QFP" n="68"/>
        </device>

         <!-- *************************  Device 'STM32WB55VC'  ***************************** -->
        <device Dname="STM32WB55VCYx">
          <memory id="IROM1"                           start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                           start="0x20000000" size="0x00020000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32WB_M4.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <feature type="CSP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32WB55VE'  ***************************** -->
        <device Dname="STM32WB55VEYx">
          <memory id="IROM1"                           start="0x08000000" size="0x00080000" startup="1" default="1" />
          <memory id="IRAM1"                           start="0x20000000" size="0x00040000" init="0"    default="1" />
          <algorithm name="CMSIS/Flash/STM32WB_M4.FLM" start="0x08000000" size="0x00080000"             default="1" />

          <feature type="CSP" n="100"/>
        </device>

