glcloud/keil_v5/ARM/PACK/.Web/Keil.STM32WBxx_DFP.pdsc
        <!-- *************************  Device 'STM32WB55VG'  ***************************** -->
        <device Dname="STM32WB55VGYx">
          <memory id="IROM1"                           start="0x08000000" size="0x001000000" startup="1" default="1" />
          <memory id="IRAM1"                           start="0x20000000" size="0x000040000"    init="0" default="1" />
          <algorithm name="CMSIS/Flash/STM32WB_M4.FLM" start="0x08000000" size="0x001000000"             default="1" />

          <feature type="CSP" n="100"/>
        </device>
      </subFamily>

   </family>

  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32WB">
      <description>STMicroelectronics STM32WB Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32WB*"/>
    </condition>

    <condition id="STM32WB55">
      <description>STMicroelectronics STM32WB55 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32WB55*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32WB CMSIS">
      <description>STMicroelectronics STM32WB Device and CMSIS-CORE</description>
      <require condition="STM32WB"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + Compiler Conditions (ARMCC) -->
    <condition id="STM32WB55 ARMCC">
      <description>STMicroelectronics STM32WB55 Devices and ARMCC Compiler</description>
      <require condition="STM32WB55"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + Compiler Conditions (GCC) -->
    <condition id="STM32WB55 GCC">
      <description>STMicroelectronics STM32WB55 Devices and GCC Compiler</description>
      <require condition="STM32WB55"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- Device + Compiler Conditions (IAR) -->
    <condition id="STM32WB55 IAR">
      <description>STMicroelectronics STM32WB55 Devices and IAR Compiler</description>
      <require condition="STM32WB55"/>
      <require condition="Compiler IAR"/>
    </condition>

    <!-- HAL Conditions -->
    <condition id="STM32WB HAL">
      <description>STMicroelectronics STM32WB Device and HAL</description>
      <require condition="STM32WB"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32WB HAL Common">
      <description>STMicroelectronics STM32L4 Device and HAL Common</description>
      <require condition="STM32WB"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
    </condition>
    <condition id="STM32WB HAL DMA">
      <description>STMicroelectronics STM32WB Device and HAL with DMA</description>
      <require condition="STM32WB"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32WB HAL GPIO">
      <description>STMicroelectronics STM32WB Device and HAL with GPIO</description>
      <require condition="STM32WB"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>

    <!-- LL driver Conditions -->
    <condition id="STM32WB LL">
      <description>STMicroelectronics STM32WB Device and LL</description>
      <require condition="STM32WB"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
    <condition id="STM32WB LL Common">
      <description>STMicroelectronics STM32WB Device and LL</description>
      <require condition="STM32WB"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"/>
    </condition>

    <!-- NUCLEO-WB55 Conditions -->
    <condition id="NUCLEO-WB55 LED">
      <description>STMicroelectronics NUCLEO-WB55 LED</description>
      <require condition="STM32WB55"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>
    <condition id="NUCLEO-WB55 Buttons">
      <description>STMicroelectronics NUCLEO-WB55 Buttons</description>
      <require condition="STM32WB55"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>

  </conditions>

  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command> <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir> <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <taxonomy>
    <description Cclass="Device" Cgroup="STM32Cube HAL">STM32WBxx Hardware Abstraction Layer (HAL) Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" Capiversion="1.1.0" exclusive="1">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>

