glcloud/keil_v5/ARM/PACK/.Web/Keil.STM32WBxx_DFP.pdsc
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32WB CMSIS">
      <description>System Startup for STMicroelectronics STM32WB Series</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STARTUP_STM32WBXX    /* Device Startup for STM32WB */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/ST/STM32WBxx/Include/"/>

        <!-- Flash Option Bytes templates -->
        <!--file category="source" condition="STM32WB ARMCC" name="MDK/Device/Source/ARM/STM32WBxx_OPT.s" attr="template" select="Flash Option Bytes"/-->
        <!--file category="source" condition="STM32WB ARMCC" name="MDK/Device/Source/ARM/STM32WBxx_OTP.s" attr="template" select="Flash One-Time programmable Bytes"/-->

        <!-- common device header file -->
        <file category="header" name="Drivers/CMSIS/Device/ST/STM32WBxx/Include/stm32wbxx.h"/>

        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="source"       condition="STM32WB55 ARMCC" name="Drivers/CMSIS/Device/ST/STM32WBxx/Source/Templates/arm/startup_stm32wb55xx_cm4.s"         attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="STM32WB55 ARMCC" name="Drivers/CMSIS/Device/ST/STM32WBxx/Source/Templates/arm/linker/stm32wb55xx_flash_cm4.sct"  attr="config" version="1.0.0"/>

        <!-- GCC Toolchain -->
        <file category="source"       condition="STM32WB55 GCC"   name="Drivers/CMSIS/Device/ST/STM32WBxx/Source/Templates/gcc/startup_stm32wb55xx_cm4.S"         attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="STM32WB55 GCC"   name="Drivers/CMSIS/Device/ST/STM32WBxx/Source/Templates/gcc/linker/stm32wb55xx_flash_cm4.ld"   attr="config" version="1.0.0"/>

        <!-- IAR Toolchain -->
        <file category="source"       condition="STM32WB55 IAR"   name="Drivers/CMSIS/Device/ST/STM32WBxx/Source/Templates/iar/startup_stm32wb55xx_cm4.s"         attr="config" version="1.0.0"/>
        <file category="linkerScript" condition="STM32WB55 IAR"   name="Drivers/CMSIS/Device/ST/STM32WBxx/Source/Templates/iar/linker/stm32wb55xx_flash_cm4.icf"  attr="config" version="1.0.0"/>

        <!-- system file -->
        <file category="source"                                   name="Drivers/CMSIS/Device/ST/STM32WBxx/Source/Templates/system_stm32wbxx.c"            attr="config" version="1.0.0"/>
      </files>
    </component>

    <component generator="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="1.0.0" Capiversion="1.1.0" condition="STM32WB">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CUBE_MX
      </RTE_Components_h>
      <files>
        <!-- this component will be replaced by the component described in gpdsc from generator -->
<!--
        <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
-->
        <file category="source" name="MDK/CubeMX/run_STM32CubeMX.c"         version="1.0.0"/>
        <file category="other"  name="MDK/CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0.0"/>
        <file category="other"  name="MDK/CubeMX/MX_Device_h.ftl"           version="1.0.0"/>
      </files>
    </component>

    <!-- START: STMicroelectronics STM32CubeWB HAL -->
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"    Cversion="1.0.0" condition="STM32WB HAL Common">
      <description>Common HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMMON
      </RTE_Components_h>
      <files>
        <file category="include" name="Drivers/STM32WBxx_HAL_Driver/Inc/"/>
        <file category="include" name="Drivers/STM32WBxx_HAL_Driver/Inc/Legacy/"/>
        <file category="header"  name="Drivers/STM32WBxx_HAL_Driver/Inc/stm32wbxx_hal.h"/>
        <file category="source"  name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"       Cversion="1.0.0" condition="STM32WB HAL DMA">
      <description>Analog-to-digital converter (ADC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ADC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_adc.c"/>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_adc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="COMP"      Cversion="1.0.0" condition="STM32WB HAL">
      <description>Analog Comparator (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_comp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"    Cversion="1.0.0" condition="STM32WB HAL">
      <description>Cortex HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CORTEX
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_cortex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRC"       Cversion="1.0.0" condition="STM32WB HAL">
      <description>CRC calculation unit (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_crc.c"/>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_crc_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRYP"      Cversion="1.0.0" condition="STM32WB HAL DMA">
      <description>Cryptographic processor (CRYP) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRYP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_cryp.c"/>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_cryp_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"       Cversion="1.0.0" condition="STM32WB HAL">
      <description>DMA controller (DMA) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_dma.c"/>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_dma_ex.c"/>
      </files>
    </component>
