glcloud/keil_v5/ARM/PACK/.Web/Keil.STM32WBxx_DFP.pdsc
    <!-- END: STMicroelectronics STM32CubeWB LL -->

    <!-- NUCLEO-WB55 Board -->
    <bundle Cbundle="NUCLEO-WB55" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics NUCLEO-WB55 Board</description>
      <doc></doc>
      <component Cgroup="LED"           Capiversion="1.0.0" condition="NUCLEO-WB55 LED">
        <description>LED Interface for STMicroelectronics NUCLEO-WB55 Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/NUCLEO-WB55/Common/LED_NUCLEO-WB55.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0" condition="NUCLEO-WB55 Buttons">
        <description>Buttons Interface for STMicroelectronics NUCLEO-WB55 Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/NUCLEO-WB55/Common/Buttons_NUCLEO-WB55.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <!-- NUCLEO-WB55 -->
    <board vendor="STMicroelectronics" name="NUCLEO-WB55"
           salesContact="http://www.st.com/stonline/contactus/contacts/index.php"
           orderForm   ="http://www.st.com/web/en/estore">
      <description>STM32 Nucleo development board with STM32WB55 MCU</description>
      <image small="MDK/Boards/ST/NUCLEO-WB55/Documentation/nucleo_wb55_small.jpg"
             large="MDK/Boards/ST/NUCLEO-WB55/Documentation/nucleo_wb55_large.jpg"/>
      <book category="overview"  name="https://www.st.com/en/evaluation-tools/p-nucleo-wb55.html" title="STM32 Nucleo board"/>
      <book category="manual"    name="MDK/Boards/ST/NUCLEO-WB55/Documentation/p-nucleo-wb55.pdf" title="Data brief"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32WB55RGVx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32WB55"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2-1"/>
      <feature type="PWR"       n="4"              name="USB VBUS, ext. VIN, ext. 5V, ext +3.3V"/>
      <feature type="CustomFF"  n="2"              name="STMicroelectronics Morpho connector"/>
      <feature type="ArduinoFF" n="2"              name="STMicroelectronics Arduino connector"/>
      <feature type="USB"       n="1"              name="USB re-enumeration capability"/>
      <feature type="Button"    n="4"              name="Push-buttons: 3 User and Reset"/>
      <feature type="LED"       n="5"              name="LEDs: COM, Power, 3 User LEDs"/>
      <debugInterface adapter="ST-Link" connector="Micro-USB"/>
    </board>
  </boards>

  <examples>
    <!-- NUCLEO-WB55 -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/NUCLEO-WB55/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="NUCLEO-WB55" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
